---
kind: property
id: P:Autodesk.Revit.DB.Visual.Tile.TileRandomSeed
source: html/95cf3f80-28b7-d36d-b2a1-7a73ebbf29d9.htm
---
# Autodesk.Revit.DB.Visual.Tile.TileRandomSeed Property

The property labeled "Randomize" from the "Tile" schema.

## Syntax (C#)
```csharp
public static string TileRandomSeed { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with a minimum of "0".